Грузимо localhost 21.1/html/html_10000_180/statistics.json
{
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 56183,
    "errorCount" : 12779,
    "errorPct" : 22.745314,
    "meanResTime" : 14139.592367798032,
    "medianResTime" : 1335.0,
    "minResTime" : 1.0,
    "maxResTime" : 151893.0,
    "pct1ResTime" : 139311.0,
    "pct2ResTime" : 144077.0,
    "pct3ResTime" : 149363.95,
    "throughput" : 278.4576115778257,
    "receivedKBytesPerSec" : 11140.66615051855,
    "sentKBytesPerSec" : 28.411088549798034
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 49835,
    "errorCount" : 7255,
    "errorPct" : 14.558042,
    "meanResTime" : 2741.0660780575795,
    "medianResTime" : 663.0,
    "minResTime" : 0.0,
    "maxResTime" : 147748.0,
    "pct1ResTime" : 2977.7000000000044,
    "pct2ResTime" : 17131.95,
    "pct3ResTime" : 141390.93000000017,
    "throughput" : 252.92845832149092,
    "receivedKBytesPerSec" : 127.54811183113657,
    "sentKBytesPerSec" : 52.808834470733174
  },
  "DELETE_character_by_id" : {
    "transaction" : "DELETE_character_by_id",
    "sampleCount" : 47937,
    "errorCount" : 6004,
    "errorPct" : 12.524772,
    "meanResTime" : 2813.059265285687,
    "medianResTime" : 648.0,
    "minResTime" : 1.0,
    "maxResTime" : 146382.0,
    "pct1ResTime" : 2522.900000000016,
    "pct2ResTime" : 14195.800000000003,
    "pct3ResTime" : 141563.0,
    "throughput" : 243.36467386889774,
    "receivedKBytesPerSec" : 116.22117034562586,
    "sentKBytesPerSec" : 47.01290544279506
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 259867,
    "errorCount" : 41138,
    "errorPct" : 15.830405,
    "meanResTime" : 5602.770825075917,
    "medianResTime" : 423.0,
    "minResTime" : 0.0,
    "maxResTime" : 151893.0,
    "pct1ResTime" : 7605.9000000000015,
    "pct2ResTime" : 11833.0,
    "pct3ResTime" : 14292.0,
    "throughput" : 1287.9686764305006,
    "receivedKBytesPerSec" : 11662.89762378262,
    "sentKBytesPerSec" : 206.09999082317302
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 54000,
    "errorCount" : 7432,
    "errorPct" : 13.762963,
    "meanResTime" : 3627.2449444444264,
    "medianResTime" : 743.0,
    "minResTime" : 1.0,
    "maxResTime" : 149691.0,
    "pct1ResTime" : 7375.800000000003,
    "pct2ResTime" : 41306.700000000004,
    "pct3ResTime" : 142981.85000000003,
    "throughput" : 270.2526862616547,
    "receivedKBytesPerSec" : 149.41021613020675,
    "sentKBytesPerSec" : 51.721484588089865
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 51912,
    "errorCount" : 7668,
    "errorPct" : 14.771152,
    "meanResTime" : 3741.883398828814,
    "medianResTime" : 681.0,
    "minResTime" : 1.0,
    "maxResTime" : 148957.0,
    "pct1ResTime" : 7573.400000000009,
    "pct2ResTime" : 70546.0,
    "pct3ResTime" : 144897.91,
    "throughput" : 262.66735480737117,
    "receivedKBytesPerSec" : 139.0959494175471,
    "sentKBytesPerSec" : 29.606909900371395
  }
}