Грузимо localhost 21.1/html/html_1000_30/statistics.json
{
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 18013,
    "errorCount" : 872,
    "errorPct" : 4.840948,
    "meanResTime" : 1264.8840837173113,
    "medianResTime" : 87.0,
    "minResTime" : 10.0,
    "maxResTime" : 29144.0,
    "pct1ResTime" : 118.0,
    "pct2ResTime" : 3499.29999999997,
    "pct3ResTime" : 28852.58,
    "throughput" : 617.4756615933087,
    "receivedKBytesPerSec" : 18421.510010937287,
    "sentKBytesPerSec" : 76.58145412338887
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 17174,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 82.23861651333449,
    "medianResTime" : 84.0,
    "minResTime" : 16.0,
    "maxResTime" : 244.0,
    "pct1ResTime" : 112.0,
    "pct2ResTime" : 117.0,
    "pct3ResTime" : 128.0,
    "throughput" : 611.4354884648249,
    "receivedKBytesPerSec" : 165.39807646948876,
    "sentKBytesPerSec" : 142.11098267053546
  },
  "DELETE_character_by_id" : {
    "transaction" : "DELETE_character_by_id",
    "sampleCount" : 17096,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 82.40395414131942,
    "medianResTime" : 84.0,
    "minResTime" : 25.0,
    "maxResTime" : 219.0,
    "pct1ResTime" : 112.0,
    "pct2ResTime" : 117.0,
    "pct3ResTime" : 128.0,
    "throughput" : 609.6352030809827,
    "receivedKBytesPerSec" : 174.43663525657027,
    "sentKBytesPerSec" : 128.5949256498948
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 86889,
    "errorCount" : 872,
    "errorPct" : 1.0035793,
    "meanResTime" : 328.09672110393535,
    "medianResTime" : 110.0,
    "minResTime" : 8.0,
    "maxResTime" : 29144.0,
    "pct1ResTime" : 123.0,
    "pct2ResTime" : 129.0,
    "pct3ResTime" : 28832.99,
    "throughput" : 2978.506787330317,
    "receivedKBytesPerSec" : 19072.24630933558,
    "sentKBytesPerSec" : 542.1893947428184
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 17338,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.32523935863475,
    "medianResTime" : 85.0,
    "minResTime" : 8.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 114.0,
    "pct2ResTime" : 119.0,
    "pct3ResTime" : 166.0,
    "throughput" : 613.1701796576602,
    "receivedKBytesPerSec" : 168.86131900728535,
    "sentKBytesPerSec" : 134.13097680011316
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 17268,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.41811443131807,
    "medianResTime" : 85.0,
    "minResTime" : 18.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 119.0,
    "pct3ResTime" : 154.3100000000013,
    "throughput" : 614.2572566875356,
    "receivedKBytesPerSec" : 166.16138681879625,
    "sentKBytesPerSec" : 77.9818782904098
  }
}