Грузимо localhost 21.1/html/html_5000/statistics.json
{
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 20000,
    "errorCount" : 4160,
    "errorPct" : 20.8,
    "meanResTime" : 2732.1270999999883,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 36411.0,
    "pct1ResTime" : 1891.800000000003,
    "pct2ResTime" : 28886.550000000007,
    "pct3ResTime" : 32796.900000000016,
    "throughput" : 475.9185227489054,
    "receivedKBytesPerSec" : 1266.2966539581548,
    "sentKBytesPerSec" : 46.747840519703026
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 20000,
    "errorCount" : 3173,
    "errorPct" : 15.865,
    "meanResTime" : 602.0365000000039,
    "medianResTime" : 7.0,
    "minResTime" : 0.0,
    "maxResTime" : 33614.0,
    "pct1ResTime" : 448.90000000000146,
    "pct2ResTime" : 604.0,
    "pct3ResTime" : 21759.970000000005,
    "throughput" : 515.9293176834774,
    "receivedKBytesPerSec" : 252.1392424706565,
    "sentKBytesPerSec" : 108.40370259899393
  },
  "DELETE_character_by_id" : {
    "transaction" : "DELETE_character_by_id",
    "sampleCount" : 20000,
    "errorCount" : 3173,
    "errorPct" : 15.865,
    "meanResTime" : 507.4595999999999,
    "medianResTime" : 7.0,
    "minResTime" : 0.0,
    "maxResTime" : 36427.0,
    "pct1ResTime" : 423.90000000000146,
    "pct2ResTime" : 559.0,
    "pct3ResTime" : 21790.590000000066,
    "throughput" : 519.8721114605806,
    "receivedKBytesPerSec" : 238.1055647029581,
    "sentKBytesPerSec" : 101.33777207994335
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 100000,
    "errorCount" : 16852,
    "errorPct" : 16.852,
    "meanResTime" : 1092.44201,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 36427.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 31143.95,
    "pct3ResTime" : 33711.97,
    "throughput" : 2378.9133123988963,
    "receivedKBytesPerSec" : 2284.8724995390853,
    "sentKBytesPerSec" : 379.6963791080859
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 20000,
    "errorCount" : 3173,
    "errorPct" : 15.865,
    "meanResTime" : 949.3932999999988,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 36393.0,
    "pct1ResTime" : 542.0,
    "pct2ResTime" : 1061.0,
    "pct3ResTime" : 32724.0,
    "throughput" : 496.1055712655653,
    "receivedKBytesPerSec" : 316.83903428399566,
    "sentKBytesPerSec" : 91.30590489656198
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 20000,
    "errorCount" : 3173,
    "errorPct" : 15.865,
    "meanResTime" : 671.1935499999956,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 36147.0,
    "pct1ResTime" : 429.0,
    "pct2ResTime" : 652.0,
    "pct3ResTime" : 20248.0,
    "throughput" : 514.0066820868672,
    "receivedKBytesPerSec" : 285.90758320483167,
    "sentKBytesPerSec" : 56.917104375481884
  }
}